api/temp/test_vu.yaml
config:
  target: "http://149.28.154.143:5000/api/v1" # Replace with your target API
  phases:
    - duration: 60 # Run the test for 60 seconds
      arrivalRate: 5 # Spawn 5 virtual users per second
  processor: "./processor.js" # Path to your processor script

scenarios:
  - flow:
      - function: "assignUserId" # Call the function to assign a unique user ID
      - get:
          url: "/{{ userId }}"